_includes/src/self-contained-gatling-jar/after/mvn-verify.txt
[INFO] Scanning for projects...
[INFO] 
[INFO] -------------------< me.jvt.hacking:fat-gatling-jar >-------------------
[INFO] Building fat-gatling-jar 0.4
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ fat-gatling-jar ---
[INFO] Deleting /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target
[INFO] 
[INFO] --- maven-resources-plugin:2.6:resources (default-resources) @ fat-gatling-jar ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 1 resource
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ fat-gatling-jar ---
[INFO] No sources to compile
[INFO] 
[INFO] --- scala-maven-plugin:3.4.4:compile (default) @ fat-gatling-jar ---
[INFO] /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/src/main/scala:-1: info: compiling
[INFO] Compiling 2 source files to /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/classes at 1542550447891
[INFO] prepare-compile in 0 s
[INFO] compile in 5 s
[INFO] 
[INFO] --- maven-resources-plugin:2.6:testResources (default-testResources) @ fat-gatling-jar ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/src/test/resources
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ fat-gatling-jar ---
[INFO] No sources to compile
[INFO] 
[INFO] --- scala-maven-plugin:3.4.4:testCompile (default) @ fat-gatling-jar ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-surefire-plugin:2.12.4:test (default-test) @ fat-gatling-jar ---
[INFO] No tests to run.
[INFO] 
[INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ fat-gatling-jar ---
[INFO] Building jar: /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/fat-gatling-jar-0.4.jar
[INFO] 
[INFO] --- maven-shade-plugin:3.1.1:shade (default) @ fat-gatling-jar ---
[INFO] Including io.gatling.highcharts:gatling-charts-highcharts:jar:3.0.0 in the shaded jar.
[INFO] Including org.scala-lang:scala-library:jar:2.12.7 in the shaded jar.
[INFO] Including io.gatling:gatling-charts:jar:3.0.0 in the shaded jar.
[INFO] Including io.gatling:gatling-core:jar:3.0.0 in the shaded jar.
[INFO] Including com.typesafe.akka:akka-slf4j_2.12:jar:2.5.17 in the shaded jar.
[INFO] Including org.simpleflatmapper:lightning-csv:jar:6.0.1 in the shaded jar.
[INFO] Including org.simpleflatmapper:sfm-util:jar:6.0.1 in the shaded jar.
[INFO] Including com.github.ben-manes.caffeine:caffeine:jar:2.6.2 in the shaded jar.
[INFO] Including io.pebbletemplates:pebble:jar:3.0.5 in the shaded jar.
[INFO] Including org.unbescape:unbescape:jar:1.1.6.RELEASE in the shaded jar.
[INFO] Including org.scala-lang.modules:scala-parser-combinators_2.12:jar:1.1.1 in the shaded jar.
[INFO] Including com.github.scopt:scopt_2.12:jar:3.7.0 in the shaded jar.
[INFO] Including io.gatling:jsonpath_2.12:jar:0.6.14 in the shaded jar.
[INFO] Including org.jodd:jodd-json:jar:5.0.5 in the shaded jar.
[INFO] Including org.jodd:jodd-bean:jar:5.0.5 in the shaded jar.
[INFO] Including org.jodd:jodd-core:jar:5.0.5 in the shaded jar.
[INFO] Including net.sf.saxon:Saxon-HE:jar:9.9.0-1 in the shaded jar.
[INFO] Including org.jodd:jodd-lagarto:jar:5.0.5 in the shaded jar.
[INFO] Including org.jodd:jodd-log:jar:5.0.5 in the shaded jar.
[INFO] Including com.tdunning:t-digest:jar:3.1 in the shaded jar.
[INFO] Including io.gatling:gatling-app:jar:3.0.0 in the shaded jar.
[INFO] Including io.gatling:gatling-http:jar:3.0.0 in the shaded jar.
[INFO] Including org.scala-lang.modules:scala-xml_2.12:jar:1.1.0 in the shaded jar.
[INFO] Including io.gatling:gatling-jms:jar:3.0.0 in the shaded jar.
[INFO] Including org.apache.geronimo.specs:geronimo-jms_1.1_spec:jar:1.1.1 in the shaded jar.
[INFO] Including io.gatling:gatling-jdbc:jar:3.0.0 in the shaded jar.
[INFO] Including io.gatling:gatling-redis:jar:3.0.0 in the shaded jar.
[INFO] Including net.debasishg:redisclient_2.12:jar:3.7 in the shaded jar.
[INFO] Including commons-pool:commons-pool:jar:1.6 in the shaded jar.
[INFO] Including io.gatling:gatling-graphite:jar:3.0.0 in the shaded jar.
[INFO] Including org.hdrhistogram:HdrHistogram:jar:2.1.10 in the shaded jar.
[INFO] Including io.gatling:gatling-recorder:jar:3.0.0 in the shaded jar.
[INFO] Including org.scala-lang.modules:scala-swing_2.12:jar:2.0.1 in the shaded jar.
[INFO] Including com.fasterxml.jackson.core:jackson-databind:jar:2.9.7 in the shaded jar.
[INFO] Including com.fasterxml.jackson.core:jackson-annotations:jar:2.9.0 in the shaded jar.
[INFO] Including com.fasterxml.jackson.core:jackson-core:jar:2.9.7 in the shaded jar.
[INFO] Including org.json4s:json4s-jackson_2.12:jar:3.6.1 in the shaded jar.
[INFO] Including org.json4s:json4s-core_2.12:jar:3.6.1 in the shaded jar.
[INFO] Including org.json4s:json4s-ast_2.12:jar:3.6.1 in the shaded jar.
[INFO] Including org.json4s:json4s-scalap_2.12:jar:3.6.1 in the shaded jar.
[INFO] Including com.thoughtworks.paranamer:paranamer:jar:2.8 in the shaded jar.
[INFO] Including org.bouncycastle:bcpkix-jdk15on:jar:1.60 in the shaded jar.
[INFO] Including org.bouncycastle:bcprov-jdk15on:jar:1.60 in the shaded jar.
[INFO] Including io.netty:netty-codec-http:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-codec:jar:4.1.30.Final in the shaded jar.
[INFO] Including com.typesafe.akka:akka-actor_2.12:jar:2.5.17 in the shaded jar.
[INFO] Including io.gatling:gatling-http-client:jar:3.0.0 in the shaded jar.
[INFO] Including io.gatling:gatling-netty-util:jar:3.0.0 in the shaded jar.
[INFO] Including io.netty:netty-buffer:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-common:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-handler:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-transport:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-handler-proxy:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-codec-socks:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-resolver-dns:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-resolver:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-codec-dns:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-transport-native-epoll:jar:linux-x86_64:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-transport-native-unix-common:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-codec-http2:jar:4.1.30.Final in the shaded jar.
[INFO] Including io.netty:netty-tcnative-boringssl-static:jar:2.0.15.Final in the shaded jar.
[INFO] Including com.sun.activation:javax.activation:jar:1.2.0 in the shaded jar.
[INFO] Including org.slf4j:slf4j-api:jar:1.7.25 in the shaded jar.
[INFO] Including com.typesafe.scala-logging:scala-logging_2.12:jar:3.9.0 in the shaded jar.
[INFO] Including ch.qos.logback:logback-classic:jar:1.2.3 in the shaded jar.
[INFO] Including ch.qos.logback:logback-core:jar:1.2.3 in the shaded jar.
[INFO] Including io.gatling:gatling-commons:jar:3.0.0 in the shaded jar.
[INFO] Including org.scala-lang:scala-reflect:jar:2.12.7 in the shaded jar.
[INFO] Including com.typesafe:config:jar:1.3.3 in the shaded jar.
[INFO] Including com.dongxiguo:fastring_2.12:jar:1.0.0 in the shaded jar.
[INFO] Including io.suzaku:boopickle_2.12:jar:1.3.0 in the shaded jar.
[INFO] Including org.typelevel:spire-macros_2.12:jar:0.16.0 in the shaded jar.
[INFO] Including com.softwaremill.quicklens:quicklens_2.12:jar:1.4.11 in the shaded jar.
[INFO] Including org.scala-lang.modules:scala-java8-compat_2.12:jar:0.9.0 in the shaded jar.
[INFO] Including com.eatthepath:fast-uuid:jar:0.1 in the shaded jar.
[INFO] Replacing original artifact with shaded artifact.
[INFO] Replacing /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/fat-gatling-jar-0.4.jar with /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/fat-gatling-jar-0.4-shaded.jar
[INFO] Dependency-reduced POM written at: /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/dependency-reduced-pom.xml
[INFO] 
[INFO] --- gatling-maven-plugin:3.0.0:test (BasicSimulation) @ fat-gatling-jar ---
Simulation me.jvt.hacking.BasicSimulation started...

================================================================================
2018-11-18 14:14:29                                           5s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> request_1                                                (OK=1      KO=0     )
> request_1 Redirect 1                                     (OK=1      KO=0     )

---- BasicSimulation -----------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done: 0     
================================================================================


================================================================================
2018-11-18 14:14:31                                           6s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> request_1                                                (OK=1      KO=0     )
> request_1 Redirect 1                                     (OK=1      KO=0     )

---- BasicSimulation -----------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done: 1     
================================================================================

Simulation me.jvt.hacking.BasicSimulation completed in 5 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                          2 (OK=2      KO=0     )
> min response time                                     31 (OK=31     KO=-     )
> max response time                                     99 (OK=99     KO=-     )
> mean response time                                    65 (OK=65     KO=-     )
> std deviation                                         34 (OK=34     KO=-     )
> response time 50th percentile                         65 (OK=65     KO=-     )
> response time 75th percentile                         82 (OK=82     KO=-     )
> response time 95th percentile                         96 (OK=96     KO=-     )
> response time 99th percentile                         98 (OK=98     KO=-     )
> mean requests/sec                                  0.333 (OK=0.333  KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 25 ms                                              0 (  0%)
> 25 ms < t < 50 ms                                      1 ( 50%)
> t > 50 ms                                              1 ( 50%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/gatling/basicsimulation-20181118141424648/index.html
[INFO] 
[INFO] --- gatling-maven-plugin:3.0.0:test (OtherSimulation) @ fat-gatling-jar ---
Simulation me.jvt.hacking.OtherSimulation started...

================================================================================
2018-11-18 14:14:42                                           5s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> request_2                                                (OK=1      KO=0     )
> request_2 Redirect 1                                     (OK=1      KO=0     )

---- BasicSimulation -----------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done: 0     
================================================================================


================================================================================
2018-11-18 14:14:43                                           6s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> request_2                                                (OK=1      KO=0     )
> request_2 Redirect 1                                     (OK=1      KO=0     )

---- BasicSimulation -----------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done: 1     
================================================================================

Simulation me.jvt.hacking.OtherSimulation completed in 5 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                          2 (OK=2      KO=0     )
> min response time                                     40 (OK=40     KO=-     )
> max response time                                     89 (OK=89     KO=-     )
> mean response time                                    65 (OK=65     KO=-     )
> std deviation                                         25 (OK=25     KO=-     )
> response time 50th percentile                         65 (OK=65     KO=-     )
> response time 75th percentile                         77 (OK=77     KO=-     )
> response time 95th percentile                         87 (OK=87     KO=-     )
> response time 99th percentile                         89 (OK=89     KO=-     )
> mean requests/sec                                  0.333 (OK=0.333  KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 25 ms                                              0 (  0%)
> 25 ms < t < 50 ms                                      1 ( 50%)
> t > 50 ms                                              1 ( 50%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/jamie/workspaces/jvt.me/tmp/fat-gatling-jar/target/gatling/othersimulation-20181118141437364/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  40.180 s
[INFO] Finished at: 2018-11-18T14:14:44Z
[INFO] ------------------------------------------------------------------------